Revit 2027 API
NurbSpline.Weights Property
Returns the weights of the nurb spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DoubleArray Weights { get; }
Public ReadOnly Property Weights As DoubleArray
	Get
public:
property DoubleArray^ Weights {
	DoubleArray^ get ();
}
member Weights : DoubleArray with get
Property Value
DoubleArray
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace